Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
on_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1685656771931162455" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132538230000" -> "1758769552771161000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4971805184500093137" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131565718000" -> "1758769553045598000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1818552299273450695" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615130978270000" -> "1758769552935482000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2635622836357233215" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131524514000" -> "1758769553249277200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1134975823906845057" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131648319000" -> "1758769552714749000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4155011192060561391" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131245623200" -> "1758769553144196000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7583832040048941255" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131830651000" -> "1758769552428052000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9000609171658778167" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131122983000" -> "1758769553325455000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8045918856116288988" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132452239000" -> "1758769553216298200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6215149718802005428" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615131225445000" -> "1758769555244700000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:5c7cc71941f5bdaca7dfd985b9fd7982c3bea8d5ea27c874796b1f91fe5cba41" -> (known after apply)
      ~ last_modified                  = "2025-09-23T08:16:12.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6705830298846999020" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615130823895000" -> "1758769552861065000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21" -> (known after apply)
      ~ code_sha256                 = "iGM/n5tXcxikhV3glBNB60fggYP9NZr752skQur6c+Q=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T08:15:50.204+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:21" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/5459ca435030b8570bf4db63948b7255531736891c9d00b32202bffb878d5552.zip" -> "builds/812c7611829ab263a42b47bb1ae282bceadda2c7a2fe77caf750637f00791f3d.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398746 -> (known after apply)
      ~ version                     = "21" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/5459ca435030b8570bf4db63948b7255531736891c9d00b32202bffb878d5552.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "7001b19a417c133d6504ff910108650f-5" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/5459ca435030b8570bf4db63948b7255531736891c9d00b32202bffb878d5552.zip" -> (known after apply)
      ~ key                           = "builds/5459ca435030b8570bf4db63948b7255531736891c9d00b32202bffb878d5552.zip" -> "builds/812c7611829ab263a42b47bb1ae282bceadda2c7a2fe77caf750637f00791f3d.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/5459ca435030b8570bf4db63948b7255531736891c9d00b32202bffb878d5552.zip" -> "builds/812c7611829ab263a42b47bb1ae282bceadda2c7a2fe77caf750637f00791f3d.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/812c7611829ab263a42b47bb1ae282bceadda2c7a2fe77caf750637f00791f3d.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/812c7611829ab263a42b47bb1ae282bceadda2c7a2fe77caf750637f00791f3d.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7198412725520374246" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/5459ca435030b8570bf4db63948b7255531736891c9d00b32202bffb878d5552.zip" -> "builds/812c7611829ab263a42b47bb1ae282bceadda2c7a2fe77caf750637f00791f3d.zip"
          ~ "timestamp" = "1758615148543369000" -> "1758769571158707000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16" -> (known after apply)
      ~ code_sha256                 = "60ZF2QwY3HPclLSbLQQj4WPEySQ5/hOTPeqZ3mGLIsM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T08:15:23.966+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/e64e506dc63caa9dd6b9caa4bbcd1661f84d7396c0bdac5762a870bc74aa337a.zip" -> "builds/9acb2b5d9f9e8521484d75c4910cf2b6050b1732a0435ab592648ee550f8c9d1.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120511 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/e64e506dc63caa9dd6b9caa4bbcd1661f84d7396c0bdac5762a870bc74aa337a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "fac898f8bac185ea0508cc0bfa8ba2b0" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/e64e506dc63caa9dd6b9caa4bbcd1661f84d7396c0bdac5762a870bc74aa337a.zip" -> (known after apply)
      ~ key                           = "builds/e64e506dc63caa9dd6b9caa4bbcd1661f84d7396c0bdac5762a870bc74aa337a.zip" -> "builds/9acb2b5d9f9e8521484d75c4910cf2b6050b1732a0435ab592648ee550f8c9d1.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/e64e506dc63caa9dd6b9caa4bbcd1661f84d7396c0bdac5762a870bc74aa337a.zip" -> "builds/9acb2b5d9f9e8521484d75c4910cf2b6050b1732a0435ab592648ee550f8c9d1.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9acb2b5d9f9e8521484d75c4910cf2b6050b1732a0435ab592648ee550f8c9d1.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9acb2b5d9f9e8521484d75c4910cf2b6050b1732a0435ab592648ee550f8c9d1.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8978256935269039327" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e64e506dc63caa9dd6b9caa4bbcd1661f84d7396c0bdac5762a870bc74aa337a.zip" -> "builds/9acb2b5d9f9e8521484d75c4910cf2b6050b1732a0435ab592648ee550f8c9d1.zip"
          ~ "timestamp" = "1758615131560551800" -> "1758769553147660000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4249273234465362524" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615132651227000" -> "1758769552351788000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "7659410d0efefea7ce94eb8b36f0cb080a77fda9"
        }

      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:60bb93badb1c68ef9be2d4983ec8ee7d266f795521d9257c09daee567d2b24ed" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:60bb93badb1c68ef9be2d4983ec8ee7d266f795521d9257c09daee567d2b24ed" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "d956a366639d0b164b961735ab4cf1f8fc20e752" -> "7659410d0efefea7ce94eb8b36f0cb080a77fda9"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "17485b413a05cbf83ffebf08ca75cc433a50ef7d"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bf6187b0d174fc52d51ebcd13aa71cf4bc4a0b9a6ab452b1df9af31bb3ee34f4" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:bf6187b0d174fc52d51ebcd13aa71cf4bc4a0b9a6ab452b1df9af31bb3ee34f4" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "164a952ca2a829978f51df33d49f04506a7079d5" -> "17485b413a05cbf83ffebf08ca75cc433a50ef7d"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5861011343762650011" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149641443000" -> "1758769571918269000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4425965719050031571" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148885931000" -> "1758769570338289000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6180060604281575599" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149370862000" -> "1758769572015881000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9210897448188898927" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148958956000" -> "1758769571724520000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5785858197822316008" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149667161000" -> "1758769571767285200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1070190832389205470" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148530432000" -> "1758769571434611000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6469205089173054160" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149078363800" -> "1758769570762978000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "477804387006096225" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148551195000" -> "1758769572411933000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c5dc45eac97813f3ec697a06f7c2b47635d7f3222560205028c5282217329ecd.zip" -> "builds/c7b70083b88f2872e354eb6b4d3bff0cf3b679e2b26cc5b182a15035469ed637.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-23T08:15:43.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/c7b70083b88f2872e354eb6b4d3bff0cf3b679e2b26cc5b182a15035469ed637.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c7b70083b88f2872e354eb6b4d3bff0cf3b679e2b26cc5b182a15035469ed637.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "908387749494055305" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c5dc45eac97813f3ec697a06f7c2b47635d7f3222560205028c5282217329ecd.zip" -> "builds/c7b70083b88f2872e354eb6b4d3bff0cf3b679e2b26cc5b182a15035469ed637.zip"
          ~ "timestamp" = "1758615148969683800" -> "1758769571466871000"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTERS"                    = jsonencode(
                  ~ {
                      ~ consequence_rank = 14 -> 12
                        # (4 unchanged attributes hidden)
                    }
                )
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7203862546282713865" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148639972000" -> "1758769571569744200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2360735596543151151" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149223404000" -> "1758769572146603200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5483654783516191055" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148836117000" -> "1758769572051673800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:60bb93badb1c68ef9be2d4983ec8ee7d266f795521d9257c09daee567d2b24ed" -> (known after apply)
      ~ last_modified                  = "2025-09-23T03:27:08.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTER_CONSEQUENCE_RANK"         = "14" -> "12"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8924651689206392269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149352602000" -> "1758769571009546000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5436808525856470330" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148320055000" -> "1758769570664213000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2787485a16b1496b051eb7407947a32276b1e6700896621f8bb978248d08edeb.zip" -> "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-23T08:15:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2969546889148228670" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2787485a16b1496b051eb7407947a32276b1e6700896621f8bb978248d08edeb.zip" -> "builds/57ccd6b4cd189e080861aba247c1d5bde35c03e555b93b8a9fe76cff8fbae565.zip"
          ~ "timestamp" = "1758615149532911000" -> "1758769570553909000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:bf6187b0d174fc52d51ebcd13aa71cf4bc4a0b9a6ab452b1df9af31bb3ee34f4" -> (known after apply)
      ~ last_modified                  = "2025-09-23T08:31:39.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8650525206572069298" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148282564000" -> "1758769571760756000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "766981139147289181" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149720958000" -> "1758769571021827000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1942618129850876387" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148528700200" -> "1758769571160840000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1767351841877624738" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615149275331000" -> "1758769571258581000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4505080159849899836" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148779655000" -> "1758769570558679200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:16",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6567832312731013674" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758615148110711000" -> "1758769571829601000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23" -> (known after apply)
      ~ code_sha256                 = "UMWQ8eYC3M55DWKE5tgaFfDWNnI8CjHl6RgZkNx24lM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-23T08:15:25.952+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:23" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 37627 -> (known after apply)
      ~ version                     = "23" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "fffb8e2cb2fe29ccf9f26afb3cb2bcaa" -> (known after apply)
      ~ id                            = "svep-backend-layers-20250815040234005900000003/builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> (known after apply)
      ~ key                           = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5183122638446966270" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b6d4ebf67024f0d058e31dec4d0b9fa07411331d70cdf3b45ef6ef0e25f24395.zip" -> "builds/baa8cfb19ae12c93eaaafb7bac6e777721a9b4a1c073d5a5e3171eef731fe1cc.zip"
          ~ "timestamp" = "1758615148817967000" -> "1758769571255802000"
        }
    }

Plan: 77 to add, 52 to change, 65 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat03-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat03-plan.out"
✅ Terraform plan created successfully: uat03-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:953f9052efb3fa3bf1b716d69867dbea402c36c4da1a873757e5075e94d39f10460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:953f9052efb3fa3bf1b716d69867dbea402c36c4da1a873757e5075e94d39f10" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:686ee8c7519980d34d60d3e4c2641a3523566ec81f3a629075eeb44136783a85460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:686ee8c7519980d34d60d3e4c2641a3523566ec81f3a629075eeb44136783a85" -> null
ℹ️  Cleaning up sensitive files and configurations
ℹ️  Removing temporary files: *.out
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for uat03!

Thank you for using Atlantis Schema Deploy
© September, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  ============================================================
ℹ️  SCRIPT EXECUTION SUMMARY
ℹ️  ============================================================
ℹ️  Environment: uat03
ℹ️  Operation: plan
ℹ️  Exit Code: 0
ℹ️  Duration: 1272s
ℹ️  Timestamp: 2025-09-25T03:09:03Z
✅ Deployment completed successfully! 🎉
ℹ️  Cleaning up sensitive files and configurations
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-uat03
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-uat03
  ```

**Note: Objects have changed outside of Terraform**
Plan: 77 to add, 52 to change, 65 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```